package day02;
//- 도메인(범위) 지식  www.naver.com, MSA

//- 코딩력
//- SQL(data다루기)

//프로그래밍을 하기 위한 프로그램
//------------------------------
//- IDE(Integreted Development Environment): eclipse
//- SDK(Software Development kit): 라이브러리(부품들의 묶음 4500) + 번역기(컴파일러) + 실행기
//
//
//
//기본 데이터 정리
//------------------
//0. 기본데이터란
//가공하지 않은 기본적인 데이터
//
//1. 기본데이터 3가지
//문자, 정수, 실수
//
//2. 변수란
//램에 만들어지는 저장공간. 변하는 값
//
//3. 변수 선언이란 어떤 의미
//램에 저장할 데이터의 타입을 정하여 저장공간을 만드는 것
//
//4. 변수 선언 방법
// 문자 char a
// 정수 int b
// 실수 double c
//
//5. 변수에 값을 넣는 것을 무엇이라고 하는가
//대입
//6. 변수에 값을 넣을 때 사용하는 기호(연산자)는
// =
//7. 기본 데이터를 저장하기 위한 변수 선언시 사용하는 예약어 3개
// 문자 char
// 정수 int
// 실수 double
// 
//8. "홍" + "길동" 에서의 + 기호는 어떤 연산자?
//결합연산자
//
//9. .기호는 어떤 역할을 하며 이름은?
//접근연산자 
//
//10. 램은 어떤 역할인가? 휘발성인가? 비휘발성인가?
//프로그램이 실행되는동안 임시로 저장하는 공간 휘발성.

//